#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
aws_acm_certificate.pub_acm_cert: Refreshing state... [id=arn:aws:acm:us-east-1:161444948461:certificate/ca905f14-6e5f-4969-92d9-9bcc56789321]
aws_iam_role.pub_last_lambda_inv_exec: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002]
aws_iam_role.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001]
aws_cloudfront_origin_access_identity.pub_origin_access_identity: Refreshing state... [id=EFVXTJMSPUTAJ]
aws_iam_role.iam_for_lambda: Refreshing state... [id=pub_lastlocal_lambda_invalidation_role]
aws_s3_bucket_public_access_block.pub_s3_bucket_pub_policy: Refreshing state... [id=lastlocalcase.sg]
aws_kms_key.credentialbucketkey: Refreshing state... [id=6f7bae89-6f6b-42e9-8189-4654b315126f]
aws_s3_bucket.pub_s3_bucket: Refreshing state... [id=lastlocalcase.sg]
aws_s3_bucket.terraform_artifact_bucket: Refreshing state... [id=sg-lastlocalcase-artifact-bucket]
aws_route53_record.pub_cert_validation: Refreshing state... [id=Z00563891EDJS4V1EERXS__3a7894d230589c3c6b3e2ca56b6488ce.lastlocalcase.sg._CNAME]
aws_lambda_function.pub_folder_index_redirect: Refreshing state... [id=pub-last-index-redirect]
aws_iam_role_policy.pub_lambda_execution: Refreshing state... [id=pub-last-lambda-policy-20210327112906936400000001:pub-last-lambda-policy-20210327112911683900000004]
aws_iam_role_policy.pub_lambda_invalidation_execution: Refreshing state... [id=public-last-inv-policy-20210327112906936800000002:public-invalidation-policy-20210327112911590900000003]
aws_lambda_function.pub_s3_invalidation: Refreshing state... [id=public_lastlocal_invalidation]
aws_lambda_permission.allow_bucket: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_cloudfront_distribution.pub_s3_distribution: Refreshing state... [id=E3INA79U1U2Q7W]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=lastlocalcase.sg]
aws_route53_record.pub_route53_record: Refreshing state... [id=Z00563891EDJS4V1EERXS_lastlocalcase.sg_A]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.pub_www_route53_record will be created
  + resource "aws_route53_record" "pub_www_route53_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.lastlocalcase.sg"
      + type            = "A"
      + zone_id         = "Z00563891EDJS4V1EERXS"

      + alias {
          + evaluate_target_health = false
          + name                   = "d2s7v0ppefjrnd.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfapply

To perform exactly these actions, run the following command to apply:
    terraform apply "tfapply"

```
</details>
*Pusher: @artagel, Action: `pull_request`*